In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
S1 = pd.Series(['Saeed', 'Mooath', 'Ali'], index=(1, 2, 3))
S1

1     Saeed
2    Mooath
3       Ali
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [7]:
S1.index = [11, 12, 13]
S1

11     Saeed
12    Mooath
13       Ali
dtype: object

## Q3: Retrieve First and second elements.

In [8]:
S1[:2]

11     Saeed
12    Mooath
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [18]:
x = pd.Series([1,2])
y = pd.Series([3,4])
z = pd.concat([x, y])
z

0    1
1    2
0    3
1    4
dtype: int64

In [19]:
z.drop_duplicates

<bound method Series.drop_duplicates of 0    1
1    2
0    3
1    4
dtype: int64>

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [22]:
 Student = {
     "ID": [1, 2, 3, 4],
     "Name": ['Saeed', 'Ahmed', 'Ali', 'Mohammed']
 }

DataF = pd.DataFrame(Student, columns=['ID', 'Name'])
DataF

   ID      Name
0   1     Saeed
1   2     Ahmed
2   3       Ali
3   4  Mohammed

## Q6: Read educ_figdp_1_Data.csv file

In [25]:
RF = pd.read_csv('educ_figdp_1_Data.csv')
RF

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [29]:
RF.loc[50:55, ["TIME", "GEO"]]

    TIME                       GEO
50  2002  Euro area (17 countries)
51  2003  Euro area (17 countries)
52  2004  Euro area (17 countries)
53  2005  Euro area (17 countries)
54  2006  Euro area (17 countries)
55  2007  Euro area (17 countries)

In [31]:
RF.loc[50:55, :]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
50,2002,Euro area (17 countries),Total public expenditure on education as % of ...,4.86,e
51,2003,Euro area (17 countries),Total public expenditure on education as % of ...,4.89,e
52,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
53,2005,Euro area (17 countries),Total public expenditure on education as % of ...,4.72,e
54,2006,Euro area (17 countries),Total public expenditure on education as % of ...,4.69,e
55,2007,Euro area (17 countries),Total public expenditure on education as % of ...,4.79,e

In [32]:
RF[:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [33]:
RF[1:11]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e